axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
void ESP32CSWebServer::handleOTA(AsyncWebServerRequest *request) {
  request->send(STATUS_OK, "text/plain", OTA_ERROR_STRINGS[Update.getError()]);
}

void handleOTAUpload(AsyncWebServerRequest *request, const String& filename, size_t index, uint8_t *data, size_t len, bool final) {
  if (!index) {
#if NEXTION_ENABLED
    nextionPages[TITLE_PAGE]->show();
    static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(0, "OTA Upload Started...");
#endif
    otaInProgress = true;
    LOG(INFO, "[WebSrv] OTA Update starting...");
    infoScreen.replaceLine(INFO_SCREEN_STATION_INFO_LINE, "Update starting");
    MotorBoardManager::powerOffAll();
    if (!Update.begin(UPDATE_SIZE_UNKNOWN, U_FLASH)) {
#if NEXTION_ENABLED
      static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, OTA_ERROR_STRINGS[Update.getError()]);
#endif
      infoScreen.replaceLine(INFO_SCREEN_STATION_INFO_LINE, OTA_ERROR_STRINGS[Update.getError()]);
      request->send(STATUS_BAD_REQUEST, "text/plain", OTA_ERROR_STRINGS[Update.getError()]);
      Update.printError(Serial);
    }
  }
  if (Update.write(data, len) != len) {
#if NEXTION_ENABLED
    static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, OTA_ERROR_STRINGS[Update.getError()]);
#endif
    infoScreen.replaceLine(INFO_SCREEN_STATION_INFO_LINE, OTA_ERROR_STRINGS[Update.getError()]);
    request->send(STATUS_BAD_REQUEST, "text/plain", OTA_ERROR_STRINGS[Update.getError()]);
    Update.printError(Serial);
  } else {
    infoScreen.replaceLine(INFO_SCREEN_STATION_INFO_LINE, "Updating: %d", Update.progress());
#if NEXTION_ENABLED
    static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, String("Progress: ") + String(Update.progress()));
#endif
  }
  if (final) {
    if (Update.end(true)) {
#if NEXTION_ENABLED
      static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, "Update Complete");
      static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(2, "Rebooting");
#endif
      infoScreen.replaceLine(INFO_SCREEN_STATION_INFO_LINE, "Update Complete");
      otaComplete = true;
      LOG(INFO, "[WebSrv] OTA Update Complete!");
    } else {
#if NEXTION_ENABLED
      static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, OTA_ERROR_STRINGS[Update.getError()]);
#endif
      infoScreen.replaceLine(INFO_SCREEN_STATION_INFO_LINE, OTA_ERROR_STRINGS[Update.getError()]);
      request->send(STATUS_BAD_REQUEST, "text/plain", OTA_ERROR_STRINGS[Update.getError()]);
      Update.printError(Serial);
    }
  }
}

void ESP32CSWebServer::handleFeatures(AsyncWebServerRequest *request) {
  auto jsonResponse = new AsyncJsonResponse();
  JsonObject &root = jsonResponse->getRoot();
#if S88_ENABLED
  root[JSON_S88_NODE] = JSON_VALUE_TRUE;
  root[JSON_S88_SENSOR_BASE_NODE] = S88_FIRST_SENSOR;
#else
  root[JSON_S88_NODE] = JSON_VALUE_FALSE;
#endif
  jsonResponse->setCode(STATUS_OK);
  jsonResponse->setLength();
  request->send(jsonResponse);
}

#define STREAM_RESOURCE_NO_REDIRECT(request, uri, mimeType, totalSize, resource) \
  if (request->url() == uri) { \
    LOG(INFO, "[WebSrv %s] Sending %s from MEMORY (%d, %s)", request->client()->remoteIP().toString().c_str(), uri, totalSize, mimeType); \
    response = request->beginResponse_P(STATUS_OK, mimeType, resource, totalSize); \
    if(String(mimeType).startsWith("text/")) { \
      response->addHeader("Content-Encoding", "gzip"); \
    } \
  }

#if WIFI_ENABLE_SOFT_AP
#define STREAM_RESOURCE(request, uri, fallback, mimeType, totalSize, resource) \
  if (request->url() == uri && softAPAddress_.compare(request->host().c_str()) == 0) { \
    LOG(INFO, "[WebSrv %s] Sending %s from MEMORY (%d, %s)", request->client()->remoteIP().toString().c_str(), uri, totalSize, mimeType); \
    response = request->beginResponse_P(STATUS_OK, mimeType, resource, totalSize); \
    if(String(mimeType).startsWith("text/")) { \
      response->addHeader("Content-Encoding", "gzip"); \
    } \
  } else if (request->url() == uri) { \
    LOG(INFO, "[WebSrv %s] Requested %s => CDN %s", request->client()->remoteIP().toString().c_str(), uri, fallback); \
    request->redirect(fallback); \
  }
#else
#define STREAM_RESOURCE(request, uri, fallback, mimeType, totalSize, resource) \
  if (request->url() == uri) { \
    LOG(INFO, "[WebSrv %s] Requested %s => CDN %s", request->client()->remoteIP().toString().c_str(), uri, fallback); \
    request->redirect(fallback); \
  }
#endif

void ESP32CSWebServer::streamResource(AsyncWebServerRequest *request) {
  const char * htmlBuildTime = __DATE__ " " __TIME__;
  if (request->header("If-Modified-Since").equals(htmlBuildTime)) {
    request->send(STATUS_NOT_MODIFIED);
  } else {
    AsyncWebServerResponse *response = nullptr;
    STREAM_RESOURCE_NO_REDIRECT(request, "/index.html", "text/html", indexHtmlGz_size, indexHtmlGz)
    STREAM_RESOURCE(request, "/jquery.min.js", "https://ajax.googleapis.com/ajax/libs/jquery/3.2.1/jquery.min.js", "text/javascript", jqueryJsGz_size, jqueryJsGz)
    STREAM_RESOURCE(request, "/jquery.mobile-1.5.0-rc1.min.js", "https://code.jquery.com/mobile/1.5.0-rc1/jquery.mobile-1.5.0-rc1.min.js", "text/javascript", jqueryMobileJsGz_size, jqueryMobileJsGz)
    STREAM_RESOURCE(request, "/jquery.mobile-1.5.0-rc1.min.css", "https://code.jquery.com/mobile/1.5.0-rc1/jquery.mobile-1.5.0-rc1.min.css", "text/css", jqueryMobileCssGz_size, jqueryMobileCssGz)
    STREAM_RESOURCE(request, "/jquery.simple.websocket.min.js", "https://cdn.rawgit.com/jbloemendal/jquery-simple-websocket/master/dist/jquery.simple.websocket.min.js", "text/javascript", jquerySimpleWebSocketGz_size, jquerySimpleWebSocketGz)
    STREAM_RESOURCE(request, "/jqClock-lite.min.js", "https://cdn.rawgit.com/JohnRDOrazio/jQuery-Clock-Plugin/master/jqClock-lite.min.js", "text/javascript", jqClockGz_size, jqClockGz)
    STREAM_RESOURCE(request, "/images/ajax-loader.gif", "https://code.jquery.com/mobile/1.5.0-rc1/images/ajax-loader.gif", "image/gif", ajaxLoader_size, ajaxLoader)
    if(response) {
      response->addHeader("Last-Modified", htmlBuildTime);
      request->send(response);
    } else {
      request->send(STATUS_NOT_FOUND, "text/plain", "URI Not Found");
    }
  }
}

// Known captive portal checks to respond with http 200 and redirect link
String portalCheckRedirect[] = {
  "/generate_204",                  // Android
  "/gen_204",                       // Android 9.0
  "/mobile/status.php",             // Android 8.0 (Samsung s9+)
  "/ncsi.txt",                      // Windows
  "/success.txt",                   // OSX
  "/hotspot-detect.html",           // iOS 8/9
  "/hotspotdetect.html",            // iOS 8/9
  "/library/test/success.html"      // iOS 8/9
  "/kindle-wifi/wifiredirect.html"  // Kindle
  "/kindle-wifi/wifistub.html"      // Kindle
};

static constexpr const char * const REDIRECT_HTML =
  "<html>"
  "<title>ESP32 Command Station v%s</title>"                                          // VERSION
  "<meta http-equiv=\"refresh\" content=\"5;url='http://%s/index.html'\" /> "         // softAPAddress_
  "<body>"
  "<h1>Welcome to the ESP32 Command Station</h1>"
  "<p>Click <a href=\"http://%s/index.html\">here</a> for ESP32 Command Station if "  // softAPAddress_
  "you are not automatically redirected in a few seconds.</p>"
  "</body>"
  "</html>";

void ESP32CSWebServer::notFoundHandler(AsyncWebServerRequest *request) {
#if WIFI_ENABLE_SOFT_AP
  for(auto uri : portalCheckRedirect) {
    if(request->url() == uri) {
      LOG(INFO,
          "[WebSrv %s] Requested %s%s: Appears to be a captive portal check, redirecting to http://%s/index.html",
          request->client()->remoteIP().toString().c_str(),
          request->host().c_str(),
          request->url().c_str(),
          softAPAddress_.c_str());
      request->send(STATUS_OK,
                    "text/html",
                    StringPrintf(REDIRECT_HTML,
                                 VERSION,
                                 softAPAddress_.c_str(),
                                 softAPAddress_.c_str()).c_str());
      return;
    }
  }
#endif
  LOG(INFO,
      "[WebSrv %s] 404: %s%s",
      request->client()->remoteIP().toString().c_str(),
      request->host().c_str(),
      request->url().c_str());
  request->send(STATUS_NOT_FOUND, "", "");
}